package ru.trusov.openai.telegrambot.constant;

public interface BotUpdates {
    String CODE_UPDATE = "UPDATE_MAY_29_2025";
    String TEXT_UPDATE = """
            🆕 <b>Обновление бота AIntellio!</b>
            
            Теперь бот умеет расшифровывать <b>видеокружки</b> — короткие видео, которые записываются в Telegram.
            
            🎁 Всем ранним пользователям, включая вас, уже доступна <b>1 бесплатная расшифровка кружка в день</b>.
            💎 А с премиум-подпиской — <b>безлимит</b> на голосовые и видеосообщения.
            
            ℹ️ Напоминаем: вы можете не только записывать своё, но и <b>пересылать кружки и голосовые из других чатов</b> — бот их тоже обработает!
            
            Попробуйте прямо сейчас — включите режим <b>«/translator»</b> и отправьте кружок.
            Спасибо, что остаетесь с нами!
            """;
}