package ru.trusov.openai.telegrambot.constant;

public interface BotUpdates {
    String CODE_UPDATE = "UPDATE_JUNE_11_2025";
    String TEXT_UPDATE = """
            ⚙️ <b>Обновление AIntellio — 11 июня</b>
            
            Бот теперь работает на новой модели <b>GPT o4-mini</b> — она:
            • 🧠 Умнее и точнее понимает вопросы
            • ⚡ Быстрее отвечает, даже при сложных запросах
            • 📄 Лучше справляется с длинными сообщениями и файлами
            • 💬 Строит более живые и естественные диалоги
            
            Всё это уже доступно вам — без подписок и настроек.
            Просто напишите что-нибудь и почувствуйте разницу ✨
            
            Попробуйте прямо сейчас — включите режим <b>«/gpt»</b>
            """;
}